public class Main {
    public static void main(String[] args) {
              System.out.println("Welcome to Hell");
              System.out.println("Оставь надежду всяк суда попавший");
              System.out.print("Не обольщайся глупыми мечтами Ты тот же приходяще-уходящий");
              System.out.println(" И не надейся плыть под парусами ");
              System.out.println("Ты не один, таких как ты навалом ");
              System.out.println("Попользовался - уступи другим ");
              System.out.println("Быть может за вот этим перевалом Ты станешь для кого-то дорогим.\n");
              System.out.println("УЧИСЬ ДАВАЙ!!!");
        
/*
Вычисление  числа ПИ методом ряда Нилаканта
 */
    double Pi =  3.0 + (4.0/(2.0*3.0*4.0) - 4.0/(4.0*5.0*6.0) + 4.0/(6.0*7.0*8.0) - 4.0/(8.0*9.0*10.0)
                + 4.0/(10.0*11.0*12.0) - 4.0/(12.0*13.0*14.0) + 4.0/(14.0*13.0*15.0) - 4.0/(15.0*16.0*17.0)
                + 4.0/(17.0*18.0*19.0) - 4.0/(19.0*20.0*21.0)+ 4.0/(21.0*22.0*23.0) - 4.0/(23.0*24.0*25.0));
        System.out.println("Пи = " + Pi);
    }
}
